## Mobile Money Dashboard
In this assignment, we look at the mobile money graphs as a dashboard and

In [1]:
import plotly.graph_objs as go
import plotly.offline as pyo
import dash
import dash_core_components as dcc
import dash_html_components as html
import dash_renderer
import pandas as pd
import os
import pandas as pd
import seaborn as sns
sns.set()
import numpy as np
import matplotlib.pyplot as plt

In [2]:
cash_outlet = pd.read_csv('training.csv')

In [3]:
cash_outlet.head()

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,Q17,Q18,Q19,Latitude,Longitude,mobile_money,savings,borrowing,insurance,mobile_money_classification
0,5086,98,2,3,1,1,2,2,0,0,...,-1,4,4,-4.460442,29.811396,0,0,0,0,0
1,1258,40,1,1,3,5,1,1,1,0,...,4,1,4,-6.176438,39.244871,1,1,1,0,3
2,331,18,2,4,6,3,2,1,0,0,...,-1,1,1,-6.825702,37.652798,1,0,0,0,2
3,6729,50,1,1,3,1,1,1,0,0,...,-1,1,4,-3.372049,35.808307,1,0,1,0,3
4,8671,34,1,1,1,1,2,1,0,1,...,-1,1,4,-7.179645,31.039095,1,1,0,1,3

In [4]:
cash_outlet.rename(inplace=True, columns={
    'Q1':'age',
    'Q2':'gender',
    'Q3':'marital status',
    'Q4':'Highest level of education',
    'Q5':'property ownership',
    'Q6':'land ownership',
    'Q7':'personal mobile status',
    'Q8_1':'salaries or wages',
    'Q8_2':'money trading or selling',
    'Q8_3':'money providing a service',
    'Q8_4':'money casual work',
    'Q8_5':'money rental income',
    'Q8_6':'money interests',
    'Q8_7':'money pension',
    'Q8_8':'money social welfare',
    'Q8_9':'money financially dependant',
    'Q8_10':'money no income',
    'Q8_11':'other',
    'Q9':'salary and wages',
    'Q10':'selling things',
    'Q11':'providing a service',
    'Q12':'send money to another country',
    'Q13':'money last sent',
    'Q14':'received money from another country',
    'Q15':'last money received',
    'Q16':'mobile money purchases',
    'Q17':'mobile money bills',
    'Q18':'literacy in kwiswhahili',
    'Q19':'literacy in english'
    
})

In [5]:
cash_outlet['mobile_money_classification'].unique()

array([0, 3, 2, 1])

In [6]:
cash_outlet['mobile_money_classification'].replace([0,1,2,3],['Nun','FS_only','MM_only','MM_FS'],inplace=True)

In [7]:
cash_outlet.groupby(by='mobile_money_classification').size()

mobile_money_classification
FS_only    1778
MM_FS      3126
MM_only     804
Nun        1386
dtype: int64

In [8]:
cash_outlet.gender= ['male' if each == 1 else 'female' for each in cash_outlet.gender]
cash_outlet.groupby(by='gender').size()

gender
female    3972
male      3122
dtype: int64

In [9]:
mobile_gender = pd.pivot_table(cash_outlet, index = 'mobile_money_classification', columns = 'gender', aggfunc = 'count', values = 'savings')
mobile_gender

gender                       female  male
mobile_money_classification
FS_only                        1083   695
MM_FS                          1521  1605
MM_only                         450   354
Nun                             918   468

In [10]:
mobile_gender.columns

Index(['female', 'male'], dtype='object', name='gender')

In [11]:
mobile_gender.male

mobile_money_classification
FS_only     695
MM_FS      1605
MM_only     354
Nun         468
Name: male, dtype: int64

In [12]:
male1 = cash_outlet[cash_outlet.gender == 'male']
female1 = cash_outlet[cash_outlet.gender == 'female']

In [13]:
cash_outlet.groupby(by='mobile_money_classification').size()

mobile_money_classification
FS_only    1778
MM_FS      3126
MM_only     804
Nun        1386
dtype: int64

In [14]:
cash_outlet['age'].unique()

array([ 98,  40,  18,  50,  34,  35,  31,  23,  56,  37,  29,  28,  17,
        22,  53,  21,  24,  38,  30,  27,  42,  44,  76,  19,  20,  26,
        32,  46,  47,  86,  25,  39,  72,  65,  54,  45,  48,  33,  57,
        51,  69,  58,  36,  52,  60,  79,  74,  70,  66,  43,  71,  41,
        16,  49,  82,  64,  55,  78,  59,  80,  94,  61,  85,  90,  77,
        62,  87,  68,  81,  75,  63,  67,  73,  96,  88,  83,  92,  84,
       100,  99,  93,  91,  95,  97,  89])

In [15]:
bins = [0, 25, 50, 75,100]
names = ['0-25', '25-50', '50-75', '75-100']

cash_outlet['AgeRange'] = pd.cut(cash_outlet['age'], bins, labels=names)

In [16]:
mobile_age = pd.pivot_table(cash_outlet, index = 'mobile_money_classification', columns = 'AgeRange', aggfunc = 'count', values = 'savings')
mobile_age

AgeRange                     0-25  25-50  50-75  75-100
mobile_money_classification
FS_only                       399    951    361      67
MM_FS                         733   1918    446      29
MM_only                       259    395    139      11
Nun                           404    557    324     101

In [17]:
cash_outlet['marital status'].replace([1,2,3,4],['Married','Divorced','Widowed','Never married'],inplace=True)

In [18]:
cash_outlet.groupby(by='marital status').size()

marital status
Divorced          687
Married          4548
Never married    1181
Widowed           678
dtype: int64

In [19]:
mobile_marital = pd.pivot_table(cash_outlet, index = 'mobile_money_classification', columns = 'marital status', aggfunc = 'count', values = 'savings')
mobile_marital

marital status               Divorced  Married  Never married  Widowed
mobile_money_classification
FS_only                           177     1216            200      185
MM_FS                             289     2087            553      197
MM_only                            94      463            186       61
Nun                               127      782            242      235

In [20]:
cash_outlet['land ownership'].replace([1,2],['Yes', 'No'],inplace=True)

In [21]:
cash_outlet.groupby(by='land ownership').size()

land ownership
No     5963
Yes    1131
dtype: int64

In [22]:
mobile_land = pd.pivot_table(cash_outlet, index = 'mobile_money_classification', columns = 'land ownership', aggfunc = 'count', values = 'savings')
mobile_land

land ownership                 No  Yes
mobile_money_classification
FS_only                      1533  245
MM_FS                        2479  647
MM_only                       699  105
Nun                          1252  134

In [ ]:
app = dash.Dash()

# app.css.append_css[{'external_url':'https://codepen.io/amyoshino/pen/jzXypZ.css'}]
app.title = 'dashboard'

app.layout = html.Div(
       html.Div([
            html.H1(children = 'dashoard for mobile money'),
           
            
            html.Div(children ='''
                Dash: Web dashboards with python,
            '''),
       
       
        dcc.Graph(
            id='mobile money',
            figure={
            'data':[
                {'x':mobile_gender.index, 'y': mobile_gender['male'], 'type': 'bar','name': 'Male'},
                {'x':mobile_gender.index, 'y': mobile_gender['female'], 'type': 'bar','name': 'Female'},
                
            
            ],
            
            'layout':{
                'title':'Relationship between mobile money class and gender'
            }
        }
    ),            
    dcc.Graph(
        id='mobile money2',
        figure={
            'data':[
                {'x':mobile_age.index, 'y':mobile_age['0-25'], 'type': 'bar','name': '0-25'},
                {'x':mobile_age.index, 'y':mobile_age['25-50'], 'type': 'bar','name': '25-50'},
                {'x':mobile_age.index, 'y':mobile_age['50-75'], 'type': 'bar','name': '50-75'},
                {'x':mobile_age.index, 'y':mobile_age['75-100'], 'type': 'bar','name': '75-100'},     
            ],
            'layout':{
                'title':'Relationship between mobile money class and age'
            }
        }
    ),
    dcc.Graph(
        id='mobile money3',
        figure={
            'data':[
                {'x':mobile_land.index, 'y':mobile_land['Yes'], 'type': 'bar','name': 'Owner'},
                {'x':mobile_land.index, 'y':mobile_land['No'], 'type': 'bar','name': 'Non_owner'},
            ],
            'layout':{
                'title':'Relationship between mobile money class and land ownership'
            }
        }
    ),
    dcc.Graph(
        id='mobile money4',
        figure={
            'data':[
                {'x':mobile_marital.index, 'y':mobile_marital['Divorced'], 'type': 'bar','name': 'Married'},
                {'x':mobile_marital.index, 'y':mobile_marital['Married'], 'type': 'bar','name': 'Divorced'},
                {'x':mobile_marital.index, 'y':mobile_marital['Never married'], 'type': 'bar','name': 'Widowed'},
                {'x':mobile_marital.index, 'y':mobile_marital['Widowed'], 'type': 'bar','name': 'Never married'},     
            ],
            'layout':{
                'title':'Relationship between mobile money class and marital status'
            }
        }
    ),
                
]))

if __name__ == '__main__':
    app.run_server()

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: Do not use the development server in a production environment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://127.0.0.1:8050/ (Press CTRL+C to quit)
127.0.0.1 - - [16/Apr/2020 17:35:01] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [16/Apr/2020 17:35:02] "GET /_dash-dependencies HTTP/1.1" 200 -
127.0.0.1 - - [16/Apr/2020 17:35:02] "GET /_dash-layout HTTP/1.1" 200 -